<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"7a2298126fefe9f35b82d8696c47a9b15899f897b2b26859014d1e46e8f5f493","plan_job_ref":"Job Terraform Plan #14 at https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10346507794","plan_out_hash":"7bcb7f547caddf04a0f7af92c7757c68ffb36c0382fcb204f18ea4c8b551fd8f","plan_hash":"040655f24cd515789b1e7a26b8a36d193df63297432dac82c56823fe6bf10734","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./roots/bucket__
With backend config: `bucket=ileri-tf-state
key=tfstate
region=eu-central-1
`
With variables: `bucket_name = "ghactions-test-f08edcc54789e4211b7a98daf4b95d2a97ba9419"`
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.bucket.aws_s3_access_point.access_point will be created
+   resource "aws_s3_access_point" "access_point" {
+       account_id               = (known after apply)
+       alias                    = (known after apply)
+       arn                      = (known after apply)
+       bucket                   = (known after apply)
+       bucket_account_id        = (known after apply)
+       domain_name              = (known after apply)
+       endpoints                = (known after apply)
+       has_public_access_policy = (known after apply)
+       id                       = (known after apply)
+       name                     = "ileriaccesspoint"
+       network_origin           = (known after apply)
+       policy                   = (known after apply)

+       vpc_configuration {
+           vpc_id = "*********************"
        }
    }

  # module.bucket.aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "ghactions-test-f08edcc54789e4211b7a98daf4b95d2a97ba9419"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all                    = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.bucket.aws_s3_bucket_ownership_controls.ownership_controls will be created
+   resource "aws_s3_bucket_ownership_controls" "ownership_controls" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.bucket.aws_s3_bucket_public_access_block.public_access will be created
+   resource "aws_s3_bucket_public_access_block" "public_access" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.bucket.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "bucket_encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "aws:kms"
#                (1 unchanged attribute hidden)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #14](https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10346507794)